@extends('main')
@section('header', "БИСКТВИТКИ")

@section('content')

    @if(Session::get('cookies') != 'accepted')
        <br />
        <form method="post" action="{{ route('cookies.accepted') }}">
            {{ csrf_field() }}
            <button type="submit" class="button is-success">ПРИЕМАМ</button>
        </form>
    @endif
        <br />
        <p class="is-size-5">
        Настоящата ПОЛИТИКА ЗА ИЗПОЛЗВАНЕ НА БИСКВИТКИ е неразделна част от сайта www.poluchi.me.<br />
        Ние използваме бисквитки, за да подобрим неговото представяне.
        Настоящата политика обяснява как правим това.
        </p>
        <br />
        <p>
        <u class="is-size-5">Какво са “бисквитките”?</u><br />
        “Бисквитките” са малки програми, които се инсталират на вашите крайни устройства, от които достъпвате сайта.<br />
        Те могат да се използват по различни начини: например за анализ на трафик, за рекламни цели, за системни отчети по дейността на сайта и за възстановяване на информация за вашето потребление, за подобряване на функционалността на сайта и неговото анализиране. С използването на термина “Бисквитки” назоваваме всички файлове и технологии, които събират информация по този начин. <br />
        Бисквитки могат също така да бъдат инсталирани от нашия сайт или от трети лица.<br /><br />
        <i>В използваните от нас и от трети страни “Бисквитки” не се съхранява информация (лични данни), която да позволява (директно) идентифицирането на Потребителя като физическо лице.</i>
        </p>
        <br />
        <p>
        <u class="is-size-5">Какви са вашите възможности за избор?</u><br />
        Всички съвременни браузъри позволяват (повече или по-малко) да променяте настройките за бисквитки.<br />
        За да научите повече за бисквитките и как да ги управлявате, можете да посетите <a href="https://www.allaboutcookies.org" target="_blank">www.allaboutcookies.org.</a>
        </p>
        <p>
        Изтриването на “Бисквитки” от страна на Потребителя може да доведе до пълна или частична невъзможност за достъп до сайта и/или услугите, до промяна или премахване на предварително зададени от него при предишни посещения в Сайта настройки и/или до съществено влошаване на качеството на Услугите, за което ние не носим отговорност.<br /><br />
        Политиката е съобразена с действащото към момента на утвърждаване законодателство, както и с общоевропейската и национална правна рамка в сферата на защитата на личните данни.
        </p>
        <br />
        <u class="is-size-5">Какви видове бисквитки използваме и за какво?</u>
        <div style="overflow-x: auto;">
            <table class="table is-striped is-fullwidth">
                <thead>
                    <tr>
                        <th>ВИД</th>
                        <th>КАТЕГОРИЯ</th>
                        <th>ДОМЕЙН</th>
                        <th>ИМЕ</th>
                        <th>ТИП</th>
                        <th>ЦЕЛ</th>
                        <th>ПЕРИОД</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>Функционални</td>
                        <td>Статистика</td>
                        <td>poluchi.me</td>
                        <td>poluchime_session</td>
                        <td>HTTP</td>
                        <td>Създава Токен за сесиите на сайта.</td>
                        <td>сесийна / до 24 часа</td>
                    </tr>
                    <tr>
                        <td>Функционални</td>
                        <td>Статистика</td>
                        <td>poluchi.me</td>
                        <td>XSRF-TOKEN</td>
                        <td>HTTP</td>
                        <td>Създава Токен за CSRF защита.</td>
                        <td>сесийна / до 24 часа</td>
                    </tr>
                    <tr>
                        <td>Google Analytics</td>
                        <td>Статистика</td>
                        <td>poluchi.me</td>
                        <td>_ga</td>
                        <td>HTTP</td>
                        <td>Регистрира потребителя с уникален идентификационен код за генериране на данни за ползването на сайта. (IP на потребителя се анонимизира, съгласно политиката на Google Analytics).</td>
                        <td>2 години</td>
                    </tr>
                    <tr>
                        <td>Google Analytics</td>
                        <td>Статистика</td>
                        <td>poluchi.me</td>
                        <td>_gid</td>
                        <td>HTTP</td>
                        <td>Регистрира потребителя с уникален идентификационен код за да може да ги рачличава. (IP на потребителя се анонимизира, съгласно политиката на Google Analytics).</td>
                        <td>сесийна / до 24 часа</td>
                    </tr>
                    <tr>
                        <td>Google Analytics</td>
                        <td>Статистика</td>
                        <td>poluchi.me</td>
                        <td>_gat_gtag</td>
                        <td>HTTP</td>
                        <td>Създава устойчив ритъм на заявките към сайта.</td>
                        <td>сесийна</td>
                    </tr>
                    <tr>
                        <td>Facebook</td>
                        <td>Маркетинг</td>
                        <td>poluchi.me</td>
                        <td>_fbp</td>
                        <td>HTTP</td>
                        <td>Използва се от facebook за продуктово позициониране.</td>
                        <td>3 месеца</td>
                    </tr>
                    <tr>
                        <td>Facebook</td>
                        <td>Маркетинг</td>
                        <td>facebook.com</td>
                        <td>fr</td>
                        <td>HTTP / ЗАЩИТЕНА</td>
                        <td>Използва се от facebook за връзка със сайта (Неквалифицирана).</td>
                        <td>3 месеца</td>
                    </tr>
                </tbody>
            </table>
        </div>
        <br />
        @if(Session::get('cookies') != 'accepted')
            <br />
            <form method="post" action="{{ route('cookies.accepted') }}">
                {{ csrf_field() }}
                <button type="submit" class="button is-success">ПРИЕМАМ</button>
            </form>
        @endif
        <br />
@endsection
